// tick sound

// player name 

// increase difficult from level & score

// settings

/// device recognition

// game center?

// normal controls

// convert to UIView/core

// conversion to swift-style guide

// convert to swift 4

/* что я хочу видеть (не в порядке приоритета):
 заставку
 выбор игра/настройки
 иконки паузы / новой игры (релоад) / настроек / сдвига цветов вместо текстовых полей
 ввод имени игрока после проигрыша
 интеграцию с гейм центром
 отойти от спрайтов (спрайты - хорошо, но что делать с разрешениями экранов?)
 добавить музыку (неактуально)
 сделать нормальное управление - сейчас двигать очень неудобно, "срывается" постоянно
 код причесать под гайды
 ввести локальную таблицу рекордов
 добавить рекламу - в идеале - ненавязчивую
 грамотно ввести градацию сложности (фигуры/цвета) - линейную или волнами
 
 */
